# Task 4.9 Introduction to Visualizations

In [1]:
#importing libraries
import pandas as pd
import numpy as np
import os

In [2]:
pd.set_option('display.max_rows',50000)

In [3]:
path = path = r'C:\Users\TEDWI\OneDrive\Documents\Insta Cart Basket Analysis'

In [4]:
# Import customers.csv 
df_cus_visual = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'customers.csv'))

In [5]:
#number of rows and columns in df
df_cus_visual.shape

(206209, 10)

In [6]:
# info on df
df_cus_visual.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [7]:
# describe df
df_cus_visual.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
# first 5 rows in df
df_cus_visual.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
#renaming columns
df_cus_visual = df_cus_visual.rename(columns={'First Name': 'first_name','Surnam': 'sur_name','Gender': 'gender', 'STATE': 'state', 'Age': 'age', 'n_dependants' : 'number_of_dependants', 'fam_status' : 'marital_status'})

In [10]:
df_cus_visual.head(5)

,user_id,first_name,sur_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
# Checking for missing values
df_cus_visual.isnull().sum()

user_id                     0
first_name              11259
sur_name                    0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependants        0
marital_status              0
income                      0
dtype: int64

### Firstname has missing values but it would be hard to replace all.

In [12]:
#checking for duplicates 
df_cus_visual_dups = df_cus_visual[df_cus_visual.duplicated()]

In [13]:
df_cus_visual_dups

Empty DataFrame
Columns: [user_id, first_name, sur_name, gender, state, age, date_joined, number_of_dependants, marital_status, income]
Index: []

### There are no duplicates.

In [14]:
#checking for mixed type columns in  data frame
for col in df_cus_visual.columns.tolist():
  weird = (df_cus_visual[[col]].applymap(type) != df_cus_visual[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cus_visual[weird]) > 0:
    print (col)

first_name

In [15]:
# changing first name  column type to str
df_cus_visual['first_name'] = df_cus_visual['first_name'].astype('str')

In [16]:
df_cus_visual.shape

(206209, 10)

In [17]:
# combinining customer data with most recent prepared data
df_ords_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared data', 'orders_merged_new.pkl'))

In [18]:
df_ords_merge.shape

(32434212, 24)

In [19]:
df_ords_merge.head(5)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,hour_of_day_order_placed,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,order_freq,order_freq_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regulary busy days,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regulary busy days,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Slowest days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Slowest days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [20]:
df_ords_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434212 entries, 0 to 32434211
Data columns (total 24 columns):
 #   Column                    Dtype
---  ------                    -----
 0   product_id                int64
 1   product_name              object
 2   aisle_id                  int64
 3   department_id             int64
 4   prices                    float64
 5   order_id                  int64
 6   user_id                   int64
 7   order_number              int64
 8   orders_day_of_week        int64
 9   hour_of_day_order_placed  int64
 10  days_since_prior_order    float64
 11  add_to_cart_order         int64
 12  reordered                 int64
 13  _merge                    category
 14  price_range_loc           object
 15  busiest_day               object
 16  busiest_days              object
 17  busiest_period_of_day     object
 18  max_order                 int64
 19  loyalty_flag              object
 20  average_price             float64
 21  spending_flag             object
 22  order_freq                float64
 23  order_freq_flag           object
dtypes: category(1), float64(4), int64(11), object(8)
memory usage: 5.8+ GB

In [21]:
# using outer join so that we do not lose any data 
df_ords_merge = pd.merge(df_ords_merge, df_cus_visual, on = 'user_id', how = 'outer')

In [22]:
# exporting file as a pickle
df_ords_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'df_ords_cus_visual.pkl'))